Revit 2027 API
FabricationPartBrowserChangedEventArgs.GetFabricationPartTypeIds Method
 Returns set of fabrication part types in use in the routing solution mode.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetFabricationPartTypeIds()
Public Function GetFabricationPartTypeIds As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetFabricationPartTypeIds()
member GetFabricationPartTypeIds : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
 The set of ElementIds for for fabrication part types that is in use in routing solution mode.
See Also
Reference
FabricationPartBrowserChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace